# Preparing the dataset for exploratory analysis


## To do:
* ~check columns' datatypes~
* ~decide what needs conversion~
* ~decide what should be deleted~
* ~add date column~
* add data from Kaggle datasets
* create final dataset for DA/DS with all columns
* save it to csv and db

In [168]:
import pandas as pd
from datetime import datetime as dt
import numpy as np
import re
import openpyxl, xlrd

In [169]:
df = pd.read_csv('ldn_properties.csv', index_col=0)
df.head()

,borough,id,address,link,title,num_of_bed,num_of_bath,reception_room,transport_primary,station1_dist(mi),transport_secondary,station2_dist(mi),tag,parking,price
0,city-of-london-london-borough,listing_58614319,"One Crown Place, 54 Wilson Street EC2A",/new-homes/details/58614319/?search_identifier...,1 bed flat for sale,1,1,0,national_rail_station,0.2 miles London Liverpool Street,london_underground_station,0.2 miles Liverpool Street,New home,0,"£1,030,000"
1,city-of-london-london-borough,listing_58614075,"The Barbican, Barbican, London EC2Y",/for-sale/details/58614075/?search_identifier=...,1 bed flat for sale,1,1,1,london_underground_station,0.2 miles Barbican,national_rail_station,0.2 miles Moorgate,New home,0,"£725,000"
2,city-of-london-london-borough,listing_52061413,"Principal Tower, Worship Lane, Shoreditch EC2A",/for-sale/details/52061413/?search_identifier=...,1 bed flat for sale,1,1,1,national_rail_station,0.2 miles Shoreditch High Street,national_rail_station,0.3 miles London Liverpool Street,New home,0,"£875,000"
3,city-of-london-london-borough,listing_55657629,"One Crown Place, Hackney EC2A",/new-homes/details/55657629/?search_identifier...,2 bed flat for sale,2,2,0,national_rail_station,0.2 miles London Liverpool Street,london_underground_station,0.2 miles Liverpool Street,New home,0,"£1,750,000"
4,city-of-london-london-borough,listing_58592857,"Barbican, London EC2Y",/for-sale/details/58592857/?search_identifier=...,Studio for sale,1,1,1,london_underground_station,0 miles Barbican,national_rail_station,0.3 miles Moorgate,New home,0,"£535,000"

In [170]:
df.dtypes

borough                object
id                     object
address                object
link                   object
title                  object
num_of_bed              int64
num_of_bath             int64
reception_room          int64
transport_primary      object
station1_dist(mi)      object
transport_secondary    object
station2_dist(mi)      object
tag                    object
parking                 int64
price                  object
dtype: object

## Typecasting and formatting:

* ~**check for duplicates** - use the id columns~
* ~**check for missing data**~
* ~**price** - delete currency sign and convert it to int~
* ~**station1/2** - extract miles and convert them to floats~
* **delete** - link

In [171]:
df.duplicated(subset='id').sum()

7317

In [172]:
df.drop_duplicates('id', keep='first', inplace=True)

In [173]:
df.shape

(63837, 15)

In [174]:
df.isna().sum()

borough                0
id                     0
address                0
link                   0
title                  0
num_of_bed             0
num_of_bath            0
reception_room         0
transport_primary      0
station1_dist(mi)      0
transport_secondary    0
station2_dist(mi)      0
tag                    0
parking                0
price                  0
dtype: int64

In [175]:
df.isnull().sum()

borough                0
id                     0
address                0
link                   0
title                  0
num_of_bed             0
num_of_bath            0
reception_room         0
transport_primary      0
station1_dist(mi)      0
transport_secondary    0
station2_dist(mi)      0
tag                    0
parking                0
price                  0
dtype: int64

In [176]:
# Checking if price values are digits only
filt = df['price'].str.contains(re.compile(r'(\d),|\d+,\d+'))
df.loc[~filt,'price']

C:\Users\Robert\anaconda3\lib\site-packages\pandas\core\strings.py:2001: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

304      POA
305      POA
595      POA
596      POA
638      POA
        ...
70832    POA
71014    POA
71069    POA
71095    POA
71130    POA
Name: price, Length: 446, dtype: object

There seem to be POA values in the price column, these will be dropped

In [177]:
df.drop(index=df[df['price'] == 'POA'].index, inplace=True)

In [178]:
df.loc[df['price'] == 'POA']

Empty DataFrame
Columns: [borough, id, address, link, title, num_of_bed, num_of_bath, reception_room, transport_primary, station1_dist(mi), transport_secondary, station2_dist(mi), tag, parking, price]
Index: []

In [179]:
#Converting prices into integers
df['price'] = [int(x.replace('£', '').replace(',', '')) for x in df['price']]

In [180]:
df['price'].dtypes

dtype('int64')

In [181]:
# Extracting the distance in miles
df['station1_dist(mi)'] = [float(x.split(' ')[0]) for x in df['station1_dist(mi)']]

In [182]:
df['station1_dist(mi)']

0        0.2
1        0.2
2        0.2
3        0.2
4        0.0
        ...
71146    0.5
71147    0.1
71149    0.1
71150    1.2
71151    1.6
Name: station1_dist(mi), Length: 63391, dtype: float64

In [183]:
df['station2_dist(mi)'] = [float(x.split(' ')[0]) for x in df['station2_dist(mi)']]

In [184]:
df['station2_dist(mi)']

0        0.2
1        0.2
2        0.3
3        0.2
4        0.3
        ...
71146    0.8
71147    1.8
71149    1.8
71150    1.3
71151    1.6
Name: station2_dist(mi), Length: 63391, dtype: float64

In [185]:
del df['link']

In [186]:
df.dtypes

borough                 object
id                      object
address                 object
title                   object
num_of_bed               int64
num_of_bath              int64
reception_room           int64
transport_primary       object
station1_dist(mi)      float64
transport_secondary     object
station2_dist(mi)      float64
tag                     object
parking                  int64
price                    int64
dtype: object

In [187]:
# Date of accessing the scraped website (this will be useful in the future for time series analysis if I continue to scrape every month)
df['date'] = dt.now().date()

In [188]:
df['borough']

0        city-of-london-london-borough
1        city-of-london-london-borough
2        city-of-london-london-borough
3        city-of-london-london-borough
4        city-of-london-london-borough
                     ...
71146        hillingdon-london-borough
71147        hillingdon-london-borough
71149        hillingdon-london-borough
71150        hillingdon-london-borough
71151        hillingdon-london-borough
Name: borough, Length: 63391, dtype: object

In [189]:
# Reformatting the boroughs
regex = re.compile(r'-london-borough|-royal-borough')
df['borough'] = [regex.sub('', x) for x in df['borough']]

In [190]:
df['borough'] = [x.replace('-', ' ') for x in df['borough']]
df['borough']

0        city of london
1        city of london
2        city of london
3        city of london
4        city of london
              ...
71146        hillingdon
71147        hillingdon
71149        hillingdon
71150        hillingdon
71151        hillingdon
Name: borough, Length: 63391, dtype: object

# Assessing the downloaded datasets:
* extract data for main dataset for DS:
    * satisfaction index
    * happiness index
    * mean/median salary
    * crime rates
* note down which datasets can be used for Dashboard/Report

## Well being dataset

In [191]:
wb = pd.read_excel('./datasets/personal-well-being-borough.xlsx', sheet_name=1, header=[0, 1])

In [192]:
wb.dropna(subset=[(' ', 'Area')], axis=0, inplace=True)

In [193]:
wb.loc[:, (' ', 'Area')] = wb[' ']['Area'].str.lower()

In [194]:
wb.loc[:, ('Life Satisfaction','2018/19')] = wb['Life Satisfaction']['2018/19'].replace(np.nan, round(np.mean(wb['Life Satisfaction']['2018/19']), 2))

In [195]:
wb.loc[:, ('Happiness','2018/19')] = wb['Happiness']['2018/19'].replace('x', round(np.mean(wb['Life Satisfaction']['2018/19']), 2))

In [196]:
borough_set1 = set(df['borough'].unique())
borough_set2 = set(wb[' ']['Area'])
borough_set1.difference(borough_set2)

{'city of westminster'}

In [197]:
borough_set2

{'barking and dagenham',
 'barnet',
 'bexley',
 'brent',
 'bromley',
 'camden',
 'city of london',
 'croydon',
 'ealing',
 'east midlands',
 'east of england',
 'enfield',
 'england',
 'greenwich',
 'hackney',
 'hammersmith and fulham',
 'haringey',
 'harrow',
 'havering',
 'hillingdon',
 'hounslow',
 'islington',
 'kensington and chelsea',
 'kingston upon thames',
 'lambeth',
 'lewisham',
 'london',
 'merton',
 'newham',
 'north east',
 'north west',
 'northern ireland',
 'redbridge',
 'richmond upon thames',
 'scotland',
 'south east',
 'south west',
 'southwark',
 'sutton',
 'tower hamlets',
 'uk',
 'wales',
 'waltham forest',
 'wandsworth',
 'west midlands',
 'westminster',
 'yorkshire and the humber'}

In [199]:
wb.loc[wb[' ']['Area'] == 'westminster', (' ', 'Area')] = 'city of westminster'

In [200]:
df['satisfaction'] = [wb.loc[wb[' ']['Area'] == x, 'Life Satisfaction']['2018/19'].values[0] for x in df['borough']]

In [201]:
df['happiness'] = [wb.loc[wb[' ']['Area'] == x, 'Happiness']['2018/19'].values[0] for x in df['borough']]

## Crime rates dataset

In [202]:
cr = pd.read_csv('./datasets/housing_in_london_monthly_variables.csv')
cr.head()

,date,area,average_price,code,houses_sold,no_of_crimes,borough_flag
0,1/1/1995,city of london,91449,E09000001,17.0,NaN,1
1,2/1/1995,city of london,82203,E09000001,7.0,NaN,1
2,3/1/1995,city of london,79121,E09000001,14.0,NaN,1
3,4/1/1995,city of london,77101,E09000001,7.0,NaN,1
4,5/1/1995,city of london,84409,E09000001,10.0,NaN,1

In [203]:
cr.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
borough_flag       int64
dtype: object

In [204]:
cr['date'] = [x.split('/')[-1] for x in cr['date']]

In [205]:
group = cr.groupby(['date'])
rates_2020 = group.get_group('2020')

In [206]:
borough_set = set(rates_2020['area'])
borough_set1.difference(borough_set2)

{'city of westminster'}

In [207]:
borough_set2

{'barking and dagenham',
 'barnet',
 'bexley',
 'brent',
 'bromley',
 'camden',
 'city of london',
 'croydon',
 'ealing',
 'east midlands',
 'east of england',
 'enfield',
 'england',
 'greenwich',
 'hackney',
 'hammersmith and fulham',
 'haringey',
 'harrow',
 'havering',
 'hillingdon',
 'hounslow',
 'islington',
 'kensington and chelsea',
 'kingston upon thames',
 'lambeth',
 'lewisham',
 'london',
 'merton',
 'newham',
 'north east',
 'north west',
 'northern ireland',
 'redbridge',
 'richmond upon thames',
 'scotland',
 'south east',
 'south west',
 'southwark',
 'sutton',
 'tower hamlets',
 'uk',
 'wales',
 'waltham forest',
 'wandsworth',
 'west midlands',
 'westminster',
 'yorkshire and the humber'}

In [208]:
rates_2020.loc[rates_2020['area'] == 'westminster', 'area'] = 'city of westminster'

C:\Users\Robert\anaconda3\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [209]:
df['crime rate'] = [rates_2020.loc[rates_2020['area'] == x, 'no_of_crimes'].values[0] for x in df['borough']]

# Median salary dataset

In [210]:
ms = pd.read_csv('./datasets/housing_in_london_yearly_variables.csv')

In [211]:
ms.tail()

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,number_of_jobs,area_size,no_of_houses,borough_flag
1066,K03000001,great britain,12/1/2019,30446.0,NaN,37603,NaN,NaN,NaN,NaN,NaN,0
1067,K04000001,england and wales,12/1/2019,30500.0,NaN,37865,NaN,NaN,NaN,NaN,NaN,0
1068,N92000002,northern ireland,12/1/2019,27434.0,NaN,32083,NaN,NaN,NaN,NaN,NaN,0
1069,S92000003,scotland,12/1/2019,30000.0,NaN,34916,NaN,NaN,NaN,NaN,NaN,0
1070,W92000004,wales,12/1/2019,27500.0,NaN,31251,NaN,NaN,NaN,NaN,NaN,0

In [212]:
ms['date'] = [x.split('/')[-1] for x in ms['date']]

In [213]:
ms_group = ms.groupby(['date'])
ms_2020 = ms_group.get_group('2019')
ms_2020.loc[ms_2020['area'] == 'westminster', 'area'] = 'city of westminster'

C:\Users\Robert\anaconda3\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [214]:
df['median salary'] = [ms_2020.loc[ms_2020['area'] == x, 'median_salary'].values[0] for x in df['borough']]

In [215]:
df.dtypes

borough                 object
id                      object
address                 object
title                   object
num_of_bed               int64
num_of_bath              int64
reception_room           int64
transport_primary       object
station1_dist(mi)      float64
transport_secondary     object
station2_dist(mi)      float64
tag                     object
parking                  int64
price                    int64
date                    object
satisfaction           float64
happiness              float64
crime rate             float64
median salary          float64
dtype: object